import type { PrizeCategory, Race, RaceCategory } from "~/types/race.types";

// 建议将 GameSession 的默认值提取为常量
export const DEFAULT_RACE: Race = {
    id: generateUniqueId(),
    name: '默认名称',
    flatCodes: [],
    specialCode: '',
    addTotalAmount: 0,
    paoTotalAmount: 0,
    flatCodeOdds: 2,
    specialCodeOdds: 47,
    createdAt: new Date().toISOString(),
    updatedAt: new Date().toISOString(),
    betRecords: [],
    paoRecords: [],
    operationRecords: [],
    numbers: Array.from({ length: 49 }, (_, i) => ({
        number: (i + 1).toString().padStart(2, '0'),
        amount: 0,
        odds: 0,
        paoAmount: 0
    })),
    otherAdd: [],
    otherPao: [],
    status: 'active'
}



export const DEFAULT_CREATE_RACE_CATEGORY: RaceCategory = {
    id: generateUniqueId(),
    name: '默认',
    races: []
}

export const DEFAULT_RACE_CATEGORYS: RaceCategory[] = [{
    id: '0',
    name: '澳门',
    races: []
}, {
    id: '1',
    name: '香港',
    races: []
}, {
    id: '2',
    name: '澳大利亚',
    races: []
}, {
    id: '3',
    name: '午夜',
    races: []
}, {
    id: '4',
    name: '十二点半',
    races: []
}, {
    id: '5',
    name: '一点半',
    races: []
}, {
    id: '6',
    name: 'TEST',
    races: []
},]

export const DEFAULT_PRIZE_CATEGORYS: PrizeCategory[] = [{
    id: '0',
    name: '澳门',
    prizes: []
}, {
    id: '1',
    name: '香港',
    prizes: []
}, {
    id: '2',
    name: '澳大利亚',
    prizes: []
}, {
    id: '3',
    name: '午夜',
    prizes: []
}, {
    id: '4',
    name: '十二点半',
    prizes: []
}, {
    id: '5',
    name: '一点半',
    prizes: []
}, {
    id: '6',
    name: 'TEST',
    prizes: []
},]



export const LOTTERY_NUMBER_CATEGORIES = {
    '单': ['01', '03', '05', '07', '09', '11', '13', '15', '17', '19', '21', '23', '25', '27', '29', '31', '33', '35', '37', '39', '41', '43', '45', '47', '49'],
    '双': ['02', '04', '06', '08', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40', '42', '44', '46', '48'],
    '大': ['25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48', '49'],
    '小': ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24'],
    '大双': ['26', '28', '30', '32', '34', '36', '38', '40', '42', '44', '46', '48'],
    '小双': ['02', '04', '06', '08', '10', '12', '14', '16', '18', '20', '22', '24'],
    '大单': ['25', '27', '29', '31', '33', '35', '37', '39', '41', '43', '45', '47', '49'],
    '小单': ['01', '03', '05', '07', '09', '11', '13', '15', '17', '19', '21', '23'],
    '红波': ['01', '02', '07', '08', '12', '13', '18', '19', '23', '24', '29', '30', '34', '35', '40', '45', '46'],
    '蓝波': ['03', '04', '09', '10', '14', '15', '20', '25', '26', '31', '36', '37', '41', '42', '47', '48'],
    '绿波': ['05', '06', '11', '16', '17', '21', '22', '27', '28', '32', '33', '38', '39', '43', '44', '49'],
    '绿单': ['05', '11', '17', '21', '27', '33', '39', '43', '49'],
    '绿双': ['06', '16', '22', '28', '32', '38', '44'],
    '红单': ['01', '07', '13', '19', '23', '29', '35', '45'],
    '红双': ['02', '08', '12', '18', '24', '30', '34', '40', '46'],
    '蓝单': ['03', '09', '15', '25', '31', '37', '41', '47'],
    '蓝双': ['04', '10', '14', '20', '26', '36', '42', '48']
};

export const ZODIAC_NUMBER_MAP = {
    '鼠': ['06', '18', '30', '42'],
    '牛': ['05', '17', '29', '41'],
    '虎': ['04', '16', '28', '40'],
    '兔': ['03', '15', '27', '39'],
    '龙': ['02', '14', '26', '38'],
    '蛇': ['01', '13', '25', '37', '49'],
    '马': ['12', '24', '36', '48'],
    '羊': ['11', '23', '35', '47'],
    '猴': ['10', '22', '34', '46'],
    '鸡': ['09', '21', '33', '45'],
    '狗': ['08', '20', '32', '44'],
    '猪': ['07', '19', '31', '43']
}